avrxml/AS6-Devices-XML/ATSAM4S16C.xml
    <module caption="Embedded Flash Controller" name="EFC" version="6450E">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Flash Access Mode" mask="0x01000000" name="FAM"/>
          <bitfield caption="Code Loops Optimization Enable" mask="0x04000000" name="CLOE"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status" mask="0x00000008" name="FLERR"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
      </register-group>
    </module>
    <module caption="General Purpose Backup Register" name="GPBR" version="6378C">
      <register-group name="GPBR">
        <register caption="General Purpose Backup Register 0" name="SYS_GPBR0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 1" name="SYS_GPBR1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 2" name="SYS_GPBR2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 3" name="SYS_GPBR3" offset="0xC" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 4" name="SYS_GPBR4" offset="0x10" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 5" name="SYS_GPBR5" offset="0x14" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 6" name="SYS_GPBR6" offset="0x18" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 7" name="SYS_GPBR7" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
      </register-group>
    </module>
    <module caption="High Speed MultiMedia Card Interface" name="HSMCI" version="6449G">
      <register-group name="HSMCI">
        <register caption="Control Register" name="HSMCI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Multi-Media Interface Enable" mask="0x00000001" name="MCIEN"/>
          <bitfield caption="Multi-Media Interface Disable" mask="0x00000002" name="MCIDIS"/>
          <bitfield caption="Power Save Mode Enable" mask="0x00000004" name="PWSEN"/>
          <bitfield caption="Power Save Mode Disable" mask="0x00000008" name="PWSDIS"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="HSMCI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x000000FF" name="CLKDIV"/>
          <bitfield caption="Power Saving Divider" mask="0x00000700" name="PWSDIV"/>
          <bitfield caption="" mask="0x00000800" name="RDPROOF"/>
          <bitfield caption="" mask="0x00001000" name="WRPROOF"/>
          <bitfield caption="Force Byte Transfer" mask="0x00002000" name="FBYTE"/>
          <bitfield caption="Padding Value" mask="0x00004000" name="PADV"/>
          <bitfield caption="PDC-oriented Mode" mask="0x00008000" name="PDCMODE"/>
          <bitfield caption="Data Block Length" mask="0xFFFF0000" name="BLKLEN"/>
        </register>
        <register caption="Data Timeout Register" name="HSMCI_DTOR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Data Timeout Cycle Number" mask="0x0000000F" name="DTOCYC"/>
          <bitfield caption="Data Timeout Multiplier" mask="0x00000070" name="DTOMUL" values="HSMCI_DTOR__DTOMUL"/>
        </register>
        <register caption="SD/SDIO Card Register" name="HSMCI_SDCR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="SDCard/SDIO Slot" mask="0x00000003" name="SDCSEL" values="HSMCI_SDCR__SDCSEL"/>
          <bitfield caption="SDCard/SDIO Bus Width" mask="0x000000C0" name="SDCBUS" values="HSMCI_SDCR__SDCBUS"/>
        </register>
        <register caption="Argument Register" name="HSMCI_ARGR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Command Argument" mask="0xFFFFFFFF" name="ARG"/>
        </register>
        <register caption="Command Register" name="HSMCI_CMDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Command Number" mask="0x0000003F" name="CMDNB"/>
          <bitfield caption="Response Type" mask="0x000000C0" name="RSPTYP" values="HSMCI_CMDR__RSPTYP"/>
          <bitfield caption="Special Command" mask="0x00000700" name="SPCMD" values="HSMCI_CMDR__SPCMD"/>
          <bitfield caption="Open Drain Command" mask="0x00000800" name="OPDCMD" values="HSMCI_CMDR__OPDCMD"/>
          <bitfield caption="Max Latency for Command to Response" mask="0x00001000" name="MAXLAT" values="HSMCI_CMDR__MAXLAT"/>
          <bitfield caption="Transfer Command" mask="0x00030000" name="TRCMD" values="HSMCI_CMDR__TRCMD"/>
          <bitfield caption="Transfer Direction" mask="0x00040000" name="TRDIR" values="HSMCI_CMDR__TRDIR"/>
          <bitfield caption="Transfer Type" mask="0x00380000" name="TRTYP" values="HSMCI_CMDR__TRTYP"/>
          <bitfield caption="SDIO Special Command" mask="0x03000000" name="IOSPCMD" values="HSMCI_CMDR__IOSPCMD"/>
          <bitfield caption="ATA with Command Completion Signal" mask="0x04000000" name="ATACS" values="HSMCI_CMDR__ATACS"/>
          <bitfield caption="Boot Operation Acknowledge." mask="0x08000000" name="BOOT_ACK"/>
        </register>
        <register caption="Block Register" name="HSMCI_BLKR" offset="0x18" rw="RW" size="4">
          <bitfield caption="MMC/SDIO Block Count - SDIO Byte Count" mask="0x0000FFFF" name="BCNT" values="HSMCI_BLKR__BCNT"/>
          <bitfield caption="Data Block Length" mask="0xFFFF0000" name="BLKLEN"/>
        </register>
        <register caption="Completion Signal Timeout Register" name="HSMCI_CSTOR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Completion Signal Timeout Cycle Number" mask="0x0000000F" name="CSTOCYC"/>
          <bitfield caption="Completion Signal Timeout Multiplier" mask="0x00000070" name="CSTOMUL" values="HSMCI_CSTOR__CSTOMUL"/>
        </register>
        <register caption="Response Register 0" name="HSMCI_RSPR0" offset="0x20" rw="R" size="4">
          <bitfield caption="Response" mask="0xFFFFFFFF" name="RSP"/>
        </register>
        <register caption="Response Register 1" name="HSMCI_RSPR1" offset="0x24" rw="R" size="4">
          <bitfield caption="Response" mask="0xFFFFFFFF" name="RSP"/>
        </register>
        <register caption="Response Register 2" name="HSMCI_RSPR2" offset="0x28" rw="R" size="4">
          <bitfield caption="Response" mask="0xFFFFFFFF" name="RSP"/>
        </register>
        <register caption="Response Register 3" name="HSMCI_RSPR3" offset="0x2C" rw="R" size="4">
          <bitfield caption="Response" mask="0xFFFFFFFF" name="RSP"/>
        </register>
