avrxml/AS6-Devices-XML/ATSAM4S16C.xml
        <register caption="FIFO Memory Aperture0 192" name="HSMCI_FIFO192" offset="0x500" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 193" name="HSMCI_FIFO193" offset="0x504" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 194" name="HSMCI_FIFO194" offset="0x508" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 195" name="HSMCI_FIFO195" offset="0x50C" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 196" name="HSMCI_FIFO196" offset="0x510" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 197" name="HSMCI_FIFO197" offset="0x514" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 198" name="HSMCI_FIFO198" offset="0x518" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 199" name="HSMCI_FIFO199" offset="0x51C" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 200" name="HSMCI_FIFO200" offset="0x520" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 201" name="HSMCI_FIFO201" offset="0x524" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 202" name="HSMCI_FIFO202" offset="0x528" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 203" name="HSMCI_FIFO203" offset="0x52C" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 204" name="HSMCI_FIFO204" offset="0x530" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 205" name="HSMCI_FIFO205" offset="0x534" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 206" name="HSMCI_FIFO206" offset="0x538" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 207" name="HSMCI_FIFO207" offset="0x53C" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 208" name="HSMCI_FIFO208" offset="0x540" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 209" name="HSMCI_FIFO209" offset="0x544" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 210" name="HSMCI_FIFO210" offset="0x548" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 211" name="HSMCI_FIFO211" offset="0x54C" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 212" name="HSMCI_FIFO212" offset="0x550" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 213" name="HSMCI_FIFO213" offset="0x554" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 214" name="HSMCI_FIFO214" offset="0x558" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 215" name="HSMCI_FIFO215" offset="0x55C" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 216" name="HSMCI_FIFO216" offset="0x560" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 217" name="HSMCI_FIFO217" offset="0x564" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 218" name="HSMCI_FIFO218" offset="0x568" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 219" name="HSMCI_FIFO219" offset="0x56C" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 220" name="HSMCI_FIFO220" offset="0x570" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
